app/views/artists/_form.html.erb

  <%= form.label :Estado, :class => "col-sm-2 col-form-label" %>
  <%= form.collection_select(:state_id, State.all, :id, :nombre, {}, {:class => "col-sm-5 btn btn-secondary dropdown-toggle"})  %>
---
SELECT "states".* FROM "states"