app/views/songs/_form.html.erb

SELECT "albums".* FROM "albums"
---
    <%= form.label "Álbum" %>
    <%= form.collection_select(:album_id, Album.all, :id, :nombre) %>