app/views/albums/_form.html.erb

    <%= form.label "Tipo de álbum" %>
    <%= form.collection_select(:album_type_id, AlbumType.all, :id, :nombre) %>
---
SELECT "album_types".* FROM "album_types"