app/views/artist_albums/_form.html.erb

SELECT "artists".* FROM "artists"
---
    <%=form.label "Artista"%>
    <%= form.collection_select(:artist_id, Artist.all, :id, :nombre) %>

SELECT "albums".* FROM "albums"
---
    <%=form.label "Álbum"%>
    <%= form.collection_select(:album_id, Album.all, :id, :nombre) %>