app/views/artist_albums/_formAlbums.html.erb

	<%=form.label "Género"%>
	<%= form.collection_select(:album_id, Album.all, :id, :nombre) %>
---
SELECT "albums".* FROM "albums"