app/views/genre_artists/_formGenres.html.erb

SELECT "genres".* FROM "genres"
---
	<%=form.label "Género", :class => "col-sm-2"%>
	<%= form.collection_select(:genre_id, Genre.all, :id, :nombre, {}, {:class =>"col-sm-5 btn btn-secondary dropdown-toggle"}) %>