app/views/genre_artists/_form.html.erb

      <%=form.label "Artista"%>
      <%= form.collection_select(:artist_id, Artist.all, :id, :nombre) %>
---
SELECT "artists".* FROM "artists"

      <%=form.label "Género"%>
      <%= form.collection_select(:genre_id, Genre.all, :id, :nombre) %>
---
SELECT "genres".* FROM "genres"