app/controllers/album_types_controller.rb

SELECT "album_types".* FROM "album_types"
---
  def index
    @album_types = AlbumType.all

INSERT INTO "album_types" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "Álbum de estudio"], ["created_at", "2020-05-09 22:40:32.950086"], ["updated_at", "2020-05-09 22:40:32.950086"]]
---
  def create
    @album_type = AlbumType.new(album_type_params)

    respond_to do |format|
      if @album_type.save

SELECT "album_types".* FROM "album_types" WHERE "album_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_album_type
      @album_type = AlbumType.find(params[:id])