app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
---
  def index
    @albums = Album.all

INSERT INTO "albums" ("nombre", "descripcion", "num_canciones", "discografica", "album_type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save

UPDATE "albums" SET "discografica" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["discografica", "hanza"], ["updated_at", "2020-05-09 22:50:03.922612"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]
---
  def destroy
    @album.destroy

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_album
      @album = Album.find(params[:id])