app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    @artists = Artist.all

INSERT INTO "artists" ("nombre", "descripcion", "fecha_ini", "fecha_fin", "informacion", "location_id", "state_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save

UPDATE "artists" SET "nombre" = ?, "state_id" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["nombre", "5555"], ["state_id", 2], ["updated_at", "2020-05-09 22:48:12.799740"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @artist.update(artist_params)

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]
---
  def destroy
    @artist.destroy

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_artist
      @artist = Artist.find(params[:id])