app/controllers/artist_albums_controller.rb

  def index
    @artist_albums = ArtistAlbum.all
---
SELECT "artist_albums".* FROM "artist_albums"

  def create
    @artist_album = ArtistAlbum.new(artist_album_params)

    respond_to do |format|
      if @artist_album.save
---
INSERT INTO "artist_albums" ("artist_id", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["artist_id", 1], ["album_id", 1], ["created_at", "2020-05-08 23:31:00.348023"], ["updated_at", "2020-05-08 23:31:00.348023"]]

  def destroy
    @artist_album.destroy
---
DELETE FROM "artist_albums" WHERE "artist_albums"."id" = ?  [["id", 12]]

    def set_artist_album
      @artist_album = ArtistAlbum.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "artist_albums".* FROM "artist_albums" WHERE "artist_albums"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

    def set_artist
      @artist = Artist.find(params[:artist_id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]