app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
    @cities = City.all

INSERT INTO "cities" ("nombre", "province_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Quito"], ["province_id", 3], ["created_at", "2020-05-08 09:15:04.756032"], ["updated_at", "2020-05-08 09:15:04.756032"]]
---
  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_city
      @city = City.find(params[:id])