app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
  def index
    @countries = Country.all

INSERT INTO "countries" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "Ecuador"], ["created_at", "2020-05-08 08:45:42.483155"], ["updated_at", "2020-05-08 08:45:42.483155"]]
---
  def create
    @country = Country.new(country_params)

    respond_to do |format|
      if @country.save

DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 1]]
---
  def destroy
    @country.destroy

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_country
      @country = Country.find(params[:id])