app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    @genres = Genre.all

INSERT INTO "genres" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "Blues"], ["created_at", "2020-05-09 22:39:16.904733"], ["updated_at", "2020-05-09 22:39:16.904733"]]
---
  def create
    @genre = Genre.new(genre_params)

    respond_to do |format|
      if @genre.save

UPDATE "genres" SET "nombre" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["nombre", "Salsa Choque"], ["updated_at", "2020-05-10 01:17:44.637159"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @genre.update(genre_params)

DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 3]]
---
  def destroy
    @genre.destroy

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_genre
      @genre = Genre.find(params[:id])