app/controllers/genre_artists_controller.rb

  def index
    @genre_artists = GenreArtist.all
---
SELECT "genre_artists".* FROM "genre_artists"

  def create
    @genre_artist = GenreArtist.new(genre_artist_params)

    respond_to do |format|
      if @genre_artist.save
---
INSERT INTO "genre_artists" ("artist_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["artist_id", 1], ["genre_id", 5], ["created_at", "2020-05-08 23:33:42.218382"], ["updated_at", "2020-05-08 23:33:42.218382"]]

  def update
    respond_to do |format|
      if @genre_artist.update(genre_artist_params)
---
UPDATE "genre_artists" SET "genre_id" = ?, "artist_id" = ?, "updated_at" = ? WHERE "genre_artists"."id" = ?  [["genre_id", 5], ["artist_id", 2], ["updated_at", "2020-05-08 23:25:42.325701"], ["id", 1]]

  def destroy
    @genre_artist.destroy
---
DELETE FROM "genre_artists" WHERE "genre_artists"."id" = ?  [["id", 41]]

    def set_genre_artist
      @genre_artist = GenreArtist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "genre_artists".* FROM "genre_artists" WHERE "genre_artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_artist
      @artist = Artist.find(params[:artist_id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]