app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("city_id", "province_id", "country_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city_id", 2], ["province_id", 3], ["country_id", 3], ["created_at", "2020-05-08 09:23:06.810195"], ["updated_at", "2020-05-08 09:23:06.810195"]]

    def set_location
      @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]