app/controllers/provinces_controller.rb

SELECT "provinces".* FROM "provinces"
---
  def index
    @provinces = Province.all

INSERT INTO "provinces" ("nombre", "country_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Pichincha"], ["country_id", 3], ["created_at", "2020-05-08 09:06:16.651079"], ["updated_at", "2020-05-08 09:06:16.651079"]]
---
  def create
    @province = Province.new(province_params)

    respond_to do |format|
      if @province.save

DELETE FROM "provinces" WHERE "provinces"."id" = ?  [["id", 1]]
---
  def destroy
    @province.destroy

SELECT "provinces".* FROM "provinces" WHERE "provinces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_province
      @province = Province.find(params[:id])