app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("nombre", "duracion_sec", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Child in time"], ["duracion_sec", 3000], ["album_id", 4], ["created_at", "2020-05-19 07:33:04.451474"], ["updated_at", "2020-05-19 07:33:04.451474"]]

  def update
    respond_to do |format|
      if @song.update(song_params)
---
UPDATE "songs" SET "nombre" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["nombre", "When a blind man criessssssss"], ["updated_at", "2020-05-09 22:50:36.751235"], ["id", 2]]

    def set_song
      @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_album
      @album = Album.find(params[:album_id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]