app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT "states".* FROM "states"

  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save
---
INSERT INTO "states" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "Separados"], ["created_at", "2020-05-09 22:39:39.895135"], ["updated_at", "2020-05-09 22:39:39.895135"]]

    def set_state
      @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]