app/views/cities/_form.html.erb

  <div class="field">
      <%= form.collection_select(:province_id, Province.all, :id, :nombre) %>
---
SELECT "provinces".* FROM "provinces"