app/views/provinces/_form.html.erb

SELECT "countries".* FROM "countries"
---
  <div class="field">
   <%= form.collection_select(:country_id, Country.all, :id, :nombre) %>