app/views/locations/_form.html.erb

  <div class="field">
    <%= form.collection_select(:country_id, Country.all, :id, :nombre) %>
---
SELECT "countries".* FROM "countries"

  <div class="field">
   <%= form.collection_select(:province_id, Province.all, :id, :nombre) %>
---
SELECT "provinces".* FROM "provinces"

  <div class="field">
    <%= form.collection_select(:city_id, City.all, :id, :nombre) %>
---
SELECT "cities".* FROM "cities"